{"config": {"input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "config": {"input_dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 64, 64, 3]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "lambda_1", "config": {"name": "lambda_1", "output_shape_type": "raw", "output_shape": null, "arguments": {}, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001zr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\nmodel_6.py\u00da\b<lambda>\u001a\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true}, "class_name": "Lambda", "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "convolution2d_2", "config": {"W_regularizer": null, "name": "convolution2d_2", "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "trainable": true, "border_mode": "same", "nb_filter": 8, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "b_constraint": null, "bias": true}, "class_name": "Convolution2D", "inbound_nodes": [[["lambda_1", 0, 0]]]}, {"name": "convolution2d_1", "config": {"W_regularizer": null, "name": "convolution2d_1", "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "trainable": true, "border_mode": "same", "nb_filter": 8, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "b_constraint": null, "bias": true}, "class_name": "Convolution2D", "inbound_nodes": [[["lambda_1", 0, 0]]]}, {"name": "convolution2d_3", "config": {"W_regularizer": null, "name": "convolution2d_3", "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "trainable": true, "border_mode": "same", "nb_filter": 8, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "b_constraint": null, "bias": true}, "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"name": "merge_1", "config": {"output_mask_type": "raw", "name": "merge_1", "output_shape_type": "raw", "output_shape": null, "mode_type": "raw", "arguments": {}, "mode": "concat", "concat_axis": 3, "output_mask": null, "dot_axes": -1}, "class_name": "Merge", "inbound_nodes": [[["convolution2d_1", 0, 0], ["convolution2d_3", 0, 0]]]}, {"name": "maxpooling2d_1", "config": {"border_mode": "valid", "name": "maxpooling2d_1", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "dropout_1", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"name": "convolution2d_5", "config": {"W_regularizer": null, "name": "convolution2d_5", "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "trainable": true, "border_mode": "same", "nb_filter": 16, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "b_constraint": null, "bias": true}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "convolution2d_4", "config": {"W_regularizer": null, "name": "convolution2d_4", "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "trainable": true, "border_mode": "same", "nb_filter": 16, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "b_constraint": null, "bias": true}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "convolution2d_6", "config": {"W_regularizer": null, "name": "convolution2d_6", "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "trainable": true, "border_mode": "same", "nb_filter": 16, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "b_constraint": null, "bias": true}, "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"name": "merge_2", "config": {"output_mask_type": "raw", "name": "merge_2", "output_shape_type": "raw", "output_shape": null, "mode_type": "raw", "arguments": {}, "mode": "concat", "concat_axis": 3, "output_mask": null, "dot_axes": -1}, "class_name": "Merge", "inbound_nodes": [[["convolution2d_4", 0, 0], ["convolution2d_6", 0, 0]]]}, {"name": "maxpooling2d_2", "config": {"border_mode": "valid", "name": "maxpooling2d_2", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["merge_2", 0, 0]]]}, {"name": "dropout_2", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "convolution2d_8", "config": {"W_regularizer": null, "name": "convolution2d_8", "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "trainable": true, "border_mode": "same", "nb_filter": 32, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "b_constraint": null, "bias": true}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"name": "convolution2d_7", "config": {"W_regularizer": null, "name": "convolution2d_7", "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "trainable": true, "border_mode": "same", "nb_filter": 32, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "b_constraint": null, "bias": true}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"name": "convolution2d_9", "config": {"W_regularizer": null, "name": "convolution2d_9", "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "trainable": true, "border_mode": "same", "nb_filter": 32, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "b_constraint": null, "bias": true}, "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"name": "merge_3", "config": {"output_mask_type": "raw", "name": "merge_3", "output_shape_type": "raw", "output_shape": null, "mode_type": "raw", "arguments": {}, "mode": "concat", "concat_axis": 3, "output_mask": null, "dot_axes": -1}, "class_name": "Merge", "inbound_nodes": [[["convolution2d_7", 0, 0], ["convolution2d_9", 0, 0]]]}, {"name": "maxpooling2d_3", "config": {"border_mode": "valid", "name": "maxpooling2d_3", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["merge_3", 0, 0]]]}, {"name": "dropout_3", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"name": "dense_1", "config": {"W_regularizer": {"name": "WeightRegularizer", "l2": 0.009999999776482582, "l1": 0.0}, "name": "dense_1", "W_constraint": null, "activation": "relu", "trainable": true, "input_dim": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 64, "init": "glorot_uniform", "b_constraint": null, "bias": true}, "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"name": "dropout_4", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0]]]}, {"name": "dense_2", "config": {"W_regularizer": null, "name": "dense_2", "W_constraint": null, "activation": "linear", "trainable": true, "input_dim": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "b_constraint": null, "bias": true}, "class_name": "Dense", "inbound_nodes": [[["dropout_4", 0, 0]]]}], "name": "model_1", "output_layers": [["dense_2", 0, 0]]}, "class_name": "Model", "keras_version": "1.1.2"}